In [7]:
import sqlalchemy
sqlalchemy.__version__

'1.4.39'

In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [11]:
engine = sqlalchemy.create_engine("mysql+mysqlconnector://Eugen:2413@localhost:3306/Test")

In [15]:
connection = engine.connect()

In [16]:
%sql mysql+mysqlconnector://Eugen:2413@localhost/Test

'Connected: Eugen@Test'

In [18]:
%%sql

#DROP TABLE car;

CREATE TABLE car (carID INT AUTO_INCREMENT PRIMARY KEY,
                  make VARCHAR(20), 
                  model VARCHAR(20), 
                  owner VARCHAR(30), 
                  year YEAR);

 * mysql+mysqlconnector://Eugen:***@localhost/Test
0 rows affected.
0 rows affected.

[]

In [19]:
%%sql 

DESCRIBE car;

 * mysql+mysqlconnector://Eugen:***@localhost/Test
5 rows affected.

[('carID', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('make', 'varchar(20)', 'YES', '', None, ''),
 ('model', 'varchar(20)', 'YES', '', None, ''),
 ('owner', 'varchar(30)', 'YES', '', None, ''),
 ('year', 'year', 'YES', '', None, '')]

In [20]:
%%sql 

INSERT INTO car (make, model, owner, year)
VALUES('nissan', 'qashqai', 'demetris trihinas', '2015');

 * mysql+mysqlconnector://Eugen:***@localhost/Test
1 rows affected.

[]

In [21]:
%sql SELECT * FROM car

 * mysql+mysqlconnector://Eugen:***@localhost/Test
1 rows affected.

[(1, 'nissan', 'qashqai', 'demetris trihinas', 2015)]